Revit 2024 API
ExternalResourceLoadData Members
The ExternalResourceLoadData type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceLoadData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetExternalResourceReference
 Returns the ExternalResourceReference that identifies which resource should be loaded.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLoadContent
 Returns the ExternalResourceLoadContent resulting from this load operation.
GetLoadContext
 Returns an object containing information about the context of the load operation.
GetLoadRequestId
 Returns the load operation GUID.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ErrorsReported
 Indicates whether the IExternalResourceUIServer has reported errors for this ExternalResourceLoadData. This value can be set by the IExternalResourceUIServer in HandleLoadResourceResults().
ExternalResourceType
 The ExternalResourceType for which Revit is requesting data from the server.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoadStatus
 The success or failure status of the load attempt.
See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace